Table: Employee

+-------------+------+
| Column Name | Type |
+-------------+------+
| id          | int  |
| salary      | int  |
+-------------+------+
id is the primary key (column with unique values) for this table.
Each row of this table contains information about the salary of an employee.
 

Write a solution to find the nth highest salary from the Employee table. If there is no nth highest salary, return null.

The result format is in the following example.

 

Example 1:

Input: 
Employee table:
+----+--------+
| id | salary |
+----+--------+
| 1  | 100    |
| 2  | 200    |
| 3  | 300    |
+----+--------+
n = 2
Output: 
+------------------------+
| getNthHighestSalary(2) |
+------------------------+
| 200                    |
+------------------------+
Example 2:

Input: 
Employee table:
+----+--------+
| id | salary |
+----+--------+
| 1  | 100    |
+----+--------+
n = 2
Output: 
+------------------------+
| getNthHighestSalary(2) |
+------------------------+
| null                   |
+------------------------+
Accepted
357.5K
Submissions
937.7K

In [1]:
import pandas as pd

def nth_highest_salary(employee: pd.DataFrame, N: int) -> pd.DataFrame:
    if(len(sorted(list(set(employee.salary.to_list())), reverse=True)) < N):
        return pd.DataFrame({'getNthHighestSalary':[pd.NA]}).rename(columns = {'getNthHighestSalary':f'getNthHighestSalary({N})'})
    else:
        return pd.DataFrame({'getNthHighestSalary':[sorted(list(set(employee.salary.to_list())), reverse=True)[N-1]]}).rename(columns = {'getNthHighestSalary':f'getNthHighestSalary({N})'})

In [2]:
data = [[1, 100], [2, 200], [3, 300]]
df1 = pd.DataFrame(data, columns=['Id', 'salary']).astype({'Id':'Int64', 'salary':'Int64'})
df1

   Id  salary
0   1     100
1   2     200
2   3     300

In [3]:
n = 2
df1.salary.sort_values(ascending=False).to_list()[n-1]

200

In [4]:
sorted(list(set(df1.salary.to_list())), reverse=True)[n-1]

200

In [5]:
pd.DataFrame({'getNthHighestSalary':[df1.salary.sort_values(ascending=False).to_list()[n-1]]})

   getNthHighestSalary
0                  200

In [6]:
data = [[1, 100]]
df2 = pd.DataFrame(data, columns=['Id', 'salary']).astype({'Id':'Int64', 'salary':'Int64'})
df2

   Id  salary
0   1     100

In [7]:
nth_highest_salary(df1,2)

   getNthHighestSalary(2)
0                     200

In [8]:
nth_highest_salary(df2,2)

  getNthHighestSalary(2)
0                   <NA>